# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a -0.104476  0.446051 -0.965409
c -0.211804  1.732077 -1.358113
e  0.020768  1.503837 -1.807873
f -1.713170 -0.897067  0.786176
h -0.312410 -0.729031 -1.475005

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [3]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a -0.104476  0.446051 -0.965409  bar  False
c -0.211804  1.732077 -1.358113  bar  False
e  0.020768  1.503837 -1.807873  bar   True
f -1.713170 -0.897067  0.786176  bar  False
h -0.312410 -0.729031 -1.475005  bar  False

Adding new rows is also simple. Below we include three extra empty rows:

In [4]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a -0.104476  0.446051 -0.965409  bar  False
b       NaN       NaN       NaN  NaN    NaN
c -0.211804  1.732077 -1.358113  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.020768  1.503837 -1.807873  bar   True
f -1.713170 -0.897067  0.786176  bar  False
g       NaN       NaN       NaN  NaN    NaN
h -0.312410 -0.729031 -1.475005  bar  False

# Your Turn Here

Do you still remember how to index a row/column?

In [28]:
#### index row 'c' below
df2.loc['c',:]

one     -0.211804
two       1.73208
three    -1.35811
four          bar
five        False
Name: c, dtype: object

In [29]:
#### index column 'two' below
df2.loc[:,'two']

a    0.446051
b         NaN
c    1.732077
d         NaN
e    1.503837
f   -0.897067
g         NaN
h   -0.729031
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [30]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [31]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [32]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

       one       two
a      NaN  0.446051
c      NaN  1.732077
e      NaN  1.503837
f -1.71317 -0.897067
h -0.31241 -0.729031

In [33]:
b = df[['one','two','three']]
b

        one       two     three
a -0.104476  0.446051 -0.965409
c -0.211804  1.732077 -1.358113
e  0.020768  1.503837 -1.807873
f -1.713170 -0.897067  0.786176
h -0.312410 -0.729031 -1.475005

In [34]:
a + b

        one  three       two
a       NaN    NaN  0.892102
c       NaN    NaN  3.464155
e       NaN    NaN  3.007674
f -3.426339    NaN -1.794134
h -0.624820    NaN -1.458063

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [35]:
a['one'].dropna()

f   -1.71317
h   -0.31241
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [36]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a  0.446051
c  1.732077
e  1.503837
f -0.897067
h -0.729031

In [37]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN  0.892102
c       NaN  3.464155
e       NaN  3.007674
f -3.426339 -1.794134
h -0.624820 -1.458063

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [38]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN  0.892102
c       NaN  3.464155
e       NaN  3.007674
f -3.426339 -1.794134
h -0.624820 -1.458063

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [39]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [40]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [41]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [42]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [48]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a       NaN       NaN  0.982045
b       NaN -0.177731       NaN
c -1.384424       NaN -0.193519
d       NaN       NaN       NaN
e -0.062152 -0.421228  2.479763

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [49]:
#### insert your code here
rand_df['one'].fillna(1,inplace = True)
print(rand_df)

rand_df['two'].fillna(method='ffill',inplace = True)
print(rand_df)

rand_df['three'].fillna(method='bfill',inplace = True)
print(rand_df)

        one       two     three
a  1.000000       NaN  0.982045
b  1.000000 -0.177731       NaN
c -1.384424       NaN -0.193519
d  1.000000       NaN       NaN
e -0.062152 -0.421228  2.479763
        one       two     three
a  1.000000       NaN  0.982045
b  1.000000 -0.177731       NaN
c -1.384424 -0.177731 -0.193519
d  1.000000 -0.177731       NaN
e -0.062152 -0.421228  2.479763
        one       two     three
a  1.000000       NaN  0.982045
b  1.000000 -0.177731 -0.193519
c -1.384424 -0.177731 -0.193519
d  1.000000 -0.177731  2.479763
e -0.062152 -0.421228  2.479763

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [50]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

          A         B         C
a -1.778481  0.565413  0.467734
b       NaN -0.268231  0.742357
c  0.279806       NaN  0.720273
d -1.041907  2.033758 -0.430356
e       NaN -0.454925  0.564989

In [51]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

True

In [52]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

A   -0.846861
B    0.469004
C    0.413000
dtype: float64

In [53]:
df_filled = my_df.fillna(my_df.mean())
df_filled

          A         B         C
a -1.778481  0.565413  0.467734
b -0.846861 -0.268231  0.742357
c  0.279806  0.469004  0.720273
d -1.041907  2.033758 -0.430356
e -0.846861 -0.454925  0.564989

In [54]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

False

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.